app/Controllers/PesananController.php

    public function create()
    {
        $mejaModel = new MejaModel();
        $pelangganModel = new PelangganModel();
        $produkModel = new ProdukModel();

        $data['meja'] = $mejaModel->where('status', 'tersedia')->findAll();
        $data['pelanggan'] = $pelangganModel->findAll();
        $data['produk'] = $produkModel->findAll();
---
SELECT *
FROM `meja`
WHERE `status` = 'tersedia'
SELECT *
FROM `pelanggan`
SELECT *
FROM `produk`