app/Models/pembayaranModel.php

INSERT INTO `pembayaran` (`pesanan_id`, `jumlah`) VALUES ('38', '100000')
SELECT *
FROM `pesanan`
WHERE `pesanan`.`id` = '38'
---
    public function prosesPembayaran($data)
    {
        $db = \Config\Database::connect();
        $db->transStart();
        $pesananModel = new \App\Models\PesananModel();
        $mejaModel = new \App\Models\MejaModel();

        $this->insert($data);

        $pesananModel->update($data['pesanan_id'], ['status' => 'selesai']);

        $pesanan = $pesananModel->find($data['pesanan_id']);

SELECT `pembayaran`.`id` as `pembayaran_id`, `pembayaran`.`jumlah` as `jumlah_dibayar`, `pesanan`.`id` as `pesanan_id`, `pesanan`.`total` as `total_tagihan`, `pembayaran`.`waktu_pembayaran`, (pembayaran.jumlah - pesanan.total) as kembalian, `pelanggan`.`nama` as `nama_pelanggan`, `meja`.`nomor_meja`
FROM `pembayaran`
JOIN `pesanan` ON `pesanan`.`id` = `pembayaran`.`pesanan_id`
JOIN `pelanggan` ON `pelanggan`.`id` = `pesanan`.`pelanggan_id`
JOIN `meja` ON `meja`.`id` = `pesanan`.`meja_id`
---
    public function getAll()
    {
        return $this->select('pembayaran.id as pembayaran_id, pembayaran.jumlah as jumlah_dibayar,
                              pesanan.id as pesanan_id, pesanan.total as total_tagihan, pembayaran.waktu_pembayaran,
                              (pembayaran.jumlah - pesanan.total) as kembalian,
                              pelanggan.nama as nama_pelanggan, meja.nomor_meja')
            ->join('pesanan', 'pesanan.id = pembayaran.pesanan_id')          // Relasi ke tabel pesanan
            ->join('pelanggan', 'pelanggan.id = pesanan.pelanggan_id')       // Relasi ke tabel pelanggan
            ->join('meja', 'meja.id = pesanan.meja_id')                     // Relasi ke tabel meja
            ->findAll();