app/Models/pesananModel.php

    public function createPesanan($dataPesanan, $dataItems, $dataPelanggan)
    {
        $db = \Config\Database::connect();
        $db->transStart();
        $pelangganModel = new \App\Models\PelangganModel();

        $pelangganId = $pelangganModel->insert($dataPelanggan);
        $dataPesanan['pelanggan_id'] = $pelangganId;
        $pesananId = $this->insert($dataPesanan, true);

        $itemPesananModel = new \App\Models\ItemPesananModel();
        foreach ($dataItems as $item) {
            $produkModel = new \App\Models\ProdukModel();
            $produk = $produkModel->find($item['produk_id']);


            $hargaItem = $produk['harga'] * $item['kuantitas'];

            $itemPesananData = [
                'pesanan_id' => $pesananId,
                'produk_id'  => $item['produk_id'],
                'harga'      => $hargaItem,
                'kuantitas'  => $item['kuantitas']
            ];

            $itemPesananModel->insert($itemPesananData);
        }

        $totalHarga = $itemPesananModel->selectSum('harga')
            ->where('pesanan_id', $pesananId)
            ->first()['harga'];
---
INSERT INTO `pelanggan` (`nama`) VALUES ('Rahul')
INSERT INTO `pesanan` (`meja_id`, `status`, `pelanggan_id`) VALUES (4, 'pending', 10)
SELECT *
FROM `produk`
WHERE `produk`.`id` = 18
INSERT INTO `item_pesanan` (`pesanan_id`, `produk_id`, `harga`, `kuantitas`) VALUES (38, 18, 60000, 2)
SELECT SUM(`harga`) AS `harga`
FROM `item_pesanan`
WHERE `pesanan_id` = 38
 LIMIT 1

        $db = \Config\Database::connect();
        $builder = $db->table('pesanan');
        $builder->where('id', $pesananId);
        $builder->update(['total' => $totalHarga]);

        $meja = $db->table('meja');
        $meja->where('id', $dataPesanan['meja_id']);
        $meja->update(['status' => 'terisi']);
---
UPDATE `pesanan` SET `total` = '200000.00'
WHERE `id` = 38
UPDATE `meja` SET `status` = 'terisi'
WHERE `id` = 4

    public function getAllPesanan()
    {
        return $this->select('pesanan.id as pesanan_id, pesanan.waktu_pesanan, pesanan.total,
                          pelanggan.nama, meja.nomor_meja, pesanan.status')
            ->join('pelanggan', 'pelanggan.id = pesanan.pelanggan_id')
            ->join('meja', 'meja.id = pesanan.meja_id')
            ->findAll();
---
SELECT `pesanan`.`id` as `pesanan_id`, `pesanan`.`waktu_pesanan`, `pesanan`.`total`, `pelanggan`.`nama`, `meja`.`nomor_meja`, `pesanan`.`status`
FROM `pesanan`
JOIN `pelanggan` ON `pelanggan`.`id` = `pesanan`.`pelanggan_id`
JOIN `meja` ON `meja`.`id` = `pesanan`.`meja_id`

    public function getPesanan($id)
    {
        return $this->select('pesanan.id as pesanan_id, pesanan.status, pesanan.total, pesanan.waktu_pesanan,
                            meja.nomor_meja, pelanggan.nama')
            ->join('meja', 'meja.id = pesanan.meja_id')
            ->join('pelanggan', 'pelanggan.id = pesanan.pelanggan_id')
            ->where('pesanan.id', $id)
            ->first();
---
SELECT `pesanan`.`id` as `pesanan_id`, `pesanan`.`status`, `pesanan`.`total`, `pesanan`.`waktu_pesanan`, `meja`.`nomor_meja`, `pelanggan`.`nama`
FROM `pesanan`
JOIN `meja` ON `meja`.`id` = `pesanan`.`meja_id`
JOIN `pelanggan` ON `pelanggan`.`id` = `pesanan`.`pelanggan_id`
WHERE `pesanan`.`id` = '38'
 LIMIT 1